Revit 2027 API
IndependentTag.IsMaterialTag Property
 Identifies if it is a material tag or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsMaterialTag { get; }
Public ReadOnly Property IsMaterialTag As Boolean
	Get
public:
property bool IsMaterialTag {
	bool get ();
}
member IsMaterialTag : bool with get
Property Value
Boolean
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace